> (nest 0)
()
> (nest 1)
(())
> (nest 2)
((()))
> (nest 3)
(((())))
> (nest 4)
((((()))))
> (nest 5)
(((((())))))
> 